component name=tdnnf13b.noop type=NoOpComponent dim=1024
component-node name=tdnnf13b.noop component=tdnnf13b.noop input=Sum(Scale(0.66, tdnnf13.noop), tdnnf13.dropout)
component name=tdnnf13b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf13b.dropout component=tdnnf13b.dropout input=tdnnf13b.noop
component name=tdnnf13b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf13b.batchnorm component=tdnnf13b.batchnorm input=tdnnf13b.dropout
component name=tdnnf13b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf13b.relu component=tdnnf13b.relu input=tdnnf13b.batchnorm
component name=tdnnf13b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf13b.affine component=tdnnf13b.affine input=tdnnf13b.relu
component name=tdnnf13b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf13b.linear component=tdnnf13b.linear input=tdnnf13b.affine

component name=tdnnf12b.noop type=NoOpComponent dim=1024
component-node name=tdnnf12b.noop component=tdnnf12b.noop input=Sum(Scale(0.66, tdnnf13b.noop), tdnnf13b.linear)
component name=tdnnf12b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf12b.dropout component=tdnnf12b.dropout input=tdnnf12b.noop
component name=tdnnf12b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf12b.batchnorm component=tdnnf12b.batchnorm input=tdnnf12b.dropout
component name=tdnnf12b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf12b.relu component=tdnnf12b.relu input=tdnnf12b.batchnorm
component name=tdnnf12b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf12b.affine component=tdnnf12b.affine input=tdnnf12b.relu
component name=tdnnf12b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf12b.linear component=tdnnf12b.linear input=tdnnf12b.affine

component name=tdnnf11b.noop type=NoOpComponent dim=1024
component-node name=tdnnf11b.noop component=tdnnf11b.noop input=Sum(Scale(0.66, tdnnf12b.noop), tdnnf12b.linear)
component name=tdnnf11b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf11b.dropout component=tdnnf11b.dropout input=tdnnf11b.noop
component name=tdnnf11b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf11b.batchnorm component=tdnnf11b.batchnorm input=tdnnf11b.dropout
component name=tdnnf11b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf11b.relu component=tdnnf11b.relu input=tdnnf11b.batchnorm
component name=tdnnf11b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf11b.affine component=tdnnf11b.affine input=tdnnf11b.relu
component name=tdnnf11b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf11b.linear component=tdnnf11b.linear input=tdnnf11b.affine

component name=tdnnf10b.noop type=NoOpComponent dim=1024
component-node name=tdnnf10b.noop component=tdnnf10b.noop input=Sum(Scale(0.66, tdnnf11b.noop), tdnnf11b.linear)
component name=tdnnf10b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf10b.dropout component=tdnnf10b.dropout input=tdnnf10b.noop
component name=tdnnf10b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf10b.batchnorm component=tdnnf10b.batchnorm input=tdnnf10b.dropout
component name=tdnnf10b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf10b.relu component=tdnnf10b.relu input=tdnnf10b.batchnorm
component name=tdnnf10b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf10b.affine component=tdnnf10b.affine input=tdnnf10b.relu
component name=tdnnf10b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf10b.linear component=tdnnf10b.linear input=tdnnf10b.affine

component name=tdnnf9b.noop type=NoOpComponent dim=1024
component-node name=tdnnf9b.noop component=tdnnf9b.noop input=Sum(Scale(0.66, tdnnf10b.noop), tdnnf10b.linear)
component name=tdnnf9b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf9b.dropout component=tdnnf9b.dropout input=tdnnf9b.noop
component name=tdnnf9b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf9b.batchnorm component=tdnnf9b.batchnorm input=tdnnf9b.dropout
component name=tdnnf9b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf9b.relu component=tdnnf9b.relu input=tdnnf9b.batchnorm
component name=tdnnf9b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf9b.affine component=tdnnf9b.affine input=tdnnf9b.relu
component name=tdnnf9b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf9b.linear component=tdnnf9b.linear input=tdnnf9b.affine

component name=tdnnf8b.noop type=NoOpComponent dim=1024
component-node name=tdnnf8b.noop component=tdnnf8b.noop input=Sum(Scale(0.66, tdnnf9b.noop), tdnnf9b.linear)
component name=tdnnf8b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf8b.dropout component=tdnnf8b.dropout input=tdnnf8b.noop
component name=tdnnf8b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf8b.batchnorm component=tdnnf8b.batchnorm input=tdnnf8b.dropout
component name=tdnnf8b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf8b.relu component=tdnnf8b.relu input=tdnnf8b.batchnorm
component name=tdnnf8b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf8b.affine component=tdnnf8b.affine input=tdnnf8b.relu
component name=tdnnf8b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf8b.linear component=tdnnf8b.linear input=tdnnf8b.affine

component name=tdnnf7b.noop type=NoOpComponent dim=1024
component-node name=tdnnf7b.noop component=tdnnf7b.noop input=Sum(Scale(0.66, tdnnf8b.noop), tdnnf8b.linear)
component name=tdnnf7b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf7b.dropout component=tdnnf7b.dropout input=tdnnf7b.noop
component name=tdnnf7b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf7b.batchnorm component=tdnnf7b.batchnorm input=tdnnf7b.dropout
component name=tdnnf7b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf7b.relu component=tdnnf7b.relu input=tdnnf7b.batchnorm
component name=tdnnf7b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf7b.affine component=tdnnf7b.affine input=tdnnf7b.relu
component name=tdnnf7b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf7b.linear component=tdnnf7b.linear input=tdnnf7b.affine

component name=tdnnf6b.noop type=NoOpComponent dim=1024
component-node name=tdnnf6b.noop component=tdnnf6b.noop input=Sum(Scale(0.66, tdnnf7b.noop), tdnnf7b.linear)
component name=tdnnf6b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf6b.dropout component=tdnnf6b.dropout input=tdnnf6b.noop
component name=tdnnf6b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf6b.batchnorm component=tdnnf6b.batchnorm input=tdnnf6b.dropout
component name=tdnnf6b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf6b.relu component=tdnnf6b.relu input=tdnnf6b.batchnorm
component name=tdnnf6b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,3
component-node name=tdnnf6b.affine component=tdnnf6b.affine input=tdnnf6b.relu
component name=tdnnf6b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-3,0 orthonormal-constraint=-1.0
component-node name=tdnnf6b.linear component=tdnnf6b.linear input=tdnnf6b.affine

component name=tdnnf5b.noop type=NoOpComponent dim=1024
component-node name=tdnnf5b.noop component=tdnnf5b.noop input=Sum(Scale(0.66, tdnnf6b.noop), tdnnf6b.linear)
component name=tdnnf5b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf5b.dropout component=tdnnf5b.dropout input=tdnnf5b.noop
component name=tdnnf5b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf5b.batchnorm component=tdnnf5b.batchnorm input=tdnnf5b.dropout
component name=tdnnf5b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf5b.relu component=tdnnf5b.relu input=tdnnf5b.batchnorm
component name=tdnnf5b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0
component-node name=tdnnf5b.affine component=tdnnf5b.affine input=tdnnf5b.relu
component name=tdnnf5b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=0 orthonormal-constraint=-1.0
component-node name=tdnnf5b.linear component=tdnnf5b.linear input=tdnnf5b.affine

component name=tdnnf4b.noop type=NoOpComponent dim=1024
component-node name=tdnnf4b.noop component=tdnnf4b.noop input=Sum(Scale(0.66, tdnnf5b.noop), tdnnf5b.linear)
component name=tdnnf4b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf4b.dropout component=tdnnf4b.dropout input=tdnnf4b.noop
component name=tdnnf4b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf4b.batchnorm component=tdnnf4b.batchnorm input=tdnnf4b.dropout
component name=tdnnf4b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf4b.relu component=tdnnf4b.relu input=tdnnf4b.batchnorm
component name=tdnnf4b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,1
component-node name=tdnnf4b.affine component=tdnnf4b.affine input=tdnnf4b.relu
component name=tdnnf4b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-1,0 orthonormal-constraint=-1.0
component-node name=tdnnf4b.linear component=tdnnf4b.linear input=tdnnf4b.affine

component name=tdnnf3b.noop type=NoOpComponent dim=1024
component-node name=tdnnf3b.noop component=tdnnf3b.noop input=Sum(Scale(0.66, tdnnf4b.noop), tdnnf4b.linear)
component name=tdnnf3b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf3b.dropout component=tdnnf3b.dropout input=tdnnf3b.noop
component name=tdnnf3b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf3b.batchnorm component=tdnnf3b.batchnorm input=tdnnf3b.dropout
component name=tdnnf3b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf3b.relu component=tdnnf3b.relu input=tdnnf3b.batchnorm
component name=tdnnf3b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,1
component-node name=tdnnf3b.affine component=tdnnf3b.affine input=tdnnf3b.relu
component name=tdnnf3b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-1,0 orthonormal-constraint=-1.0
component-node name=tdnnf3b.linear component=tdnnf3b.linear input=tdnnf3b.affine

component name=tdnnf2b.noop type=NoOpComponent dim=1024
component-node name=tdnnf2b.noop component=tdnnf2b.noop input=Sum(Scale(0.66, tdnnf3b.noop), tdnnf3b.linear)
component name=tdnnf2b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnnf2b.dropout component=tdnnf2b.dropout input=tdnnf2b.noop
component name=tdnnf2b.batchnorm type=BatchNormComponent dim=1024
component-node name=tdnnf2b.batchnorm component=tdnnf2b.batchnorm input=tdnnf2b.dropout
component name=tdnnf2b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnnf2b.relu component=tdnnf2b.relu input=tdnnf2b.batchnorm
component name=tdnnf2b.affine type=TdnnComponent input-dim=1024 output-dim=128 l2-regularize=0.008 max-change=0.75 time-offsets=0,1
component-node name=tdnnf2b.affine component=tdnnf2b.affine input=tdnnf2b.relu
component name=tdnnf2b.linear type=TdnnComponent input-dim=128 output-dim=1024 l2-regularize=0.008 max-change=0.75 use-bias=false time-offsets=-1,0 orthonormal-constraint=-1.0
component-node name=tdnnf2b.linear component=tdnnf2b.linear input=tdnnf2b.affine

component name=tdnn1b.dropout type=GeneralDropoutComponent dim=1024 dropout-proportion=0.0 continuous=true
component-node name=tdnn1b.dropout component=tdnn1b.dropout input=Sum(Scale(0.66, tdnnf2b.noop), tdnnf2b.linear)
component name=tdnn1b.batchnorm type=BatchNormComponent dim=1024 target-rms=1.0
component-node name=tdnn1b.batchnorm component=tdnn1b.batchnorm input=tdnn1b.dropout
component name=tdnn1b.relu type=RectifiedLinearComponent dim=1024 self-repair-scale=1e-05
component-node name=tdnn1b.relu component=tdnn1b.relu input=tdnn1b.batchnorm
component name=tdnn1b.affine type=NaturalGradientAffineComponent input-dim=1024 output-dim=160  max-change=0.75 l2-regularize=0.008
component-node name=tdnn1b.affine component=tdnn1b.affine input=tdnn1b.relu

component name=lda_inv type=FixedAffineComponent matrix=exp/encoder_decoder/lda_inv.mat
component-node name=lda_inv component=lda_inv input=tdnn1b.affine

component name=prefinal type=FixedAffineComponent matrix=exp/encoder_decoder/offset_inv.mat
component-node name=prefinal component=prefinal input=lda_inv

component name=output.noop  type=NoOpComponent dim=20
component-node name=output.noop component=output.noop input=prefinal

output-node name=output-temp input=output.noop objective=quadratic
